[
  {
    "name": "Charudatta Thute",
    "desg": "CEO & FOUNDER",
    "linkedin": "",
    "twitter": "",
    "categories": ["consulting", "core-team", "tech-services"],
    "img": "charudatta-thute.jpg",
    "bio": [
      "Charu has worked in the CRM domain for the last 18 years in different capacities starting as developer to leading global teams.  He has worked in CRM technology with global giants, developing products complementing CRM processes and published white papers on CRM operations/technology. With a deep understanding of the CRM arena, he holds an MBA from University of Mumbai. He loves reading books and talking about CRM technology in his free time."
    ]
  },
  {
    "name": "Jason Linkswiler",
    "desg": "Partner",
    "linkedin": "",
    "twitter": "",
    "categories": ["consulting", "core-team", "tech-services"],
    "img": "jason-linkswiler.jpg",
    "bio": [
      "With over 20 years of experience in business transformation, operations, and strategy, Jason helps organizations optimize their growth investments and GTM systems by delivering scalable, cost-effective CRM solutions that drive measurable business outcomes. A trusted advisor to PE/VC firms, corporate strategy teams, and C-suite executives, he has led high-impact digital transformation initiatives across industries, including financial services, energy, media, and technology, bridging strategic vision with hands-on execution to drive efficiency, customer engagement, and long-term growth.",
      "Jason did MBA from Texas McCombs school of Business and is based in Austin,US."
    ]
  },
  {
    "name": "Jeremy Joseph",
    "desg": "Partner",
    "linkedin": "",
    "twitter": "",
    "categories": ["consulting", "core-team", "tech-services"],
    "img": "Jeremy-Joseph.jpg",
    "bio": [
      "Jeremy is an experienced 20 year CRM executive with consultative experiences ranging from global enterprise to Silicon Valley startup successes.  He is based in Palo Alto, California."
    ]
  },
  {
    "name": "Atul Kumthekar",
    "desg": "Partner",
    "linkedin": "",
    "twitter": "",
    "categories": ["consulting", "core-team", "tech-services"],
    "img": "Atul-Kumthekar.jpg",
    "bio": [
      "Atul is a Salesforce and enterprise CRM architect with over 20 years of experience in designing, architecting, and implementing scalable CRM solutions for mid-market and enterprise clients across financial services, SaaS, sustainability, and B2B industries.  He specializes in CRM strategy, system architecture, and automation, helping organizations optimize their GTM systems and customer engagement through innovative, cost-effective solutions. As a trusted partner to C-suite executives, he has led complex digital transformation initiatives, integrating Salesforce and other CRM platforms to drive efficiency, scalability, and long-term business growth.",
      "Atul is a B.Tech graduate from IIT Bombay and based in US and India."
    ]
  },
  {
    "name": "Michael Lin",
    "desg": "Partner",
    "linkedin": "",
    "twitter": "",
    "categories": ["consulting", "core-team", "tech-services"],
    "img": "Michael.jpg",
    "bio": [
      "Michael's journey from building computers at 12 to mastering system integration and automation showcases a lifelong passion for technology. He firmly believes that CRM systems should adapt to human workflows, not the other way around. With a history of successful turnkey optimization projects for diverse clients, Michael is ready to bring his expertise to projects across Southeast Asia. He is based in Singapore."
    ]
  }
]
